package by.andd3dfx.common;

/**
 * Дано К массивов целых чисел длиной N каждый, упорядоченных по возрастанию.
 * Вернуть один массив, содержащий все эти числа, также упорядоченные по возрастанию.
 * Пример:
 * [[1,2,3], [4,6,7], [2,5,9]] -> [1,2,2,3,4,5,6,7,9]
 * <p>
 * Оценить сложность алгоритма (желательно получить сложность лучше, чем KN*log(KN)).
 */
public class MergeArrays {

    public int[] merge(int[][] arrays) {
        // TODO: add implementation
        return null;
    }
}
